Revit 2020 API
AdvancedGlazing Properties
The AdvancedGlazing type exposes the following members.
Properties
Name | Description
GlazingBackfaceCulling
 The property labeled "Backface Culling" from the "PrismGlazing" schema.
GlazingF0
 The property labeled "Reflective Color" from the "PrismGlazing" schema.
GlazingTransmissionColor
 The property labeled "Transmissive color" from the "PrismGlazing" schema.
GlazingTransmissionRoughness
 The property labeled "Transmissive roughness" from the "PrismGlazing" schema.
SurfaceAlbedo
 The property labeled "Color" from the "PrismGlazing" schema.
SurfaceAnisotropy
 The property labeled "Anisotropy" from the "PrismGlazing" schema.
SurfaceCutout
 The property labeled "Image" from the "PrismGlazing" schema.
SurfaceNdfType
 The property labeled "NDF" from the "PrismGlazing" schema.
SurfaceNormal
 The property labeled "Image" from the "PrismGlazing" schema.
SurfaceRotation
 The property labeled "Rotation" from the "PrismGlazing" schema.
SurfaceRoughness
 The property labeled "Roughness" from the "PrismGlazing" schema.
See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace